ErpTest/src/Documents/РегистрацияПрочихКонтролируемыхСделок/РегистрацияПрочихКонтролируемыхСделок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияПрочихКонтролируемыхСделок</name>
  <registerRecords>AccumulationRegister.КонтролируемыеСделкиОрганизаций</registerRecords>
  <attributes>
    <name>УведомлениеОКонтролируемойСделке</name>
    <type>
      <types>DocumentRef.УведомлениеОКонтролируемыхСделках</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.ДоговорыЛизинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общая) Сумма в рублях, включая налоги</comment>
    <type>
      <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сделки</name>
    <attributes>
      <name>ДатаСовершенияСделки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСделки</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.НематериальныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПредметаСделки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДСВРублях</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДСВВалютеРасчетов</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСВРублях</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСВВалютеРасчетов</name>
      <type>
        <types>DefinedType.ДенежноеПолеЛюбойЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПредметаСделки</name>
      <type>
        <types>EnumRef.ТипыПредметовКонтролируемыхСделок</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКонтролируемойСделки</name>
      <type>
        <types>EnumRef.ТипыКонтролируемыхСделок</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхожденияПредметаСделки</name>
      <type>
        <types>CatalogRef.СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузоотправитель</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Организации</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОперацияОблагаетсяЕНВД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/Enums/ХозяйственныеОперацииКонтролируемыхСделок/ХозяйственныеОперацииКонтролируемыхСделок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперацииКонтролируемыхСделок</name>
  <enumValues>
    <name>РеализацияСобственныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКомиссионныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>РеализацияСобственныхУслуг</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКомиссионныхУслуг</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеУслуг</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеАгентскихУслуг</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеОбъектовСтроительства</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеНематериальныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеОсновныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РеализацияОсновныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваров</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>ПрочаяОперация</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/РегистрацияПрочихКонтролируемыхСделок/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
	Возврат; //В дальнейшем будет добавлен код команд
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции "УправлениеПечатью.СоздатьКоллекциюКомандПечати".
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстЗапросаКонтролируемыхСделокОрганизаций(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПрочиеКонтролируемыеСделки.Ссылка,
	               |	ПрочиеКонтролируемыеСделки.Дата КАК Период,
	               |	ПрочиеКонтролируемыеСделки.УведомлениеОКонтролируемойСделке КАК Уведомление,
	               |	ПрочиеКонтролируемыеСделки.Организация,
	               |	ПрочиеКонтролируемыеСделки.Контрагент,
	               |	ПрочиеКонтролируемыеСделки.ДоговорКонтрагента КАК Аналитика,
	               |	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПрочаяОперация) КАК ХозяйственнаяОперация,
	               |	ПрочиеКонтролируемыеСделки.ВалютаДокумента КАК Валюта
	               |ИЗ
	               |	Документ.РегистрацияПрочихКонтролируемыхСделок КАК ПрочиеКонтролируемыеСделки
	               |ГДЕ
	               |	ПрочиеКонтролируемыеСделки.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период", Реквизиты.Период);
	Запрос.УстановитьПараметр("Ссылка", Реквизиты.Ссылка);
	Запрос.УстановитьПараметр("Уведомление", Реквизиты.Уведомление);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("Контрагент", Реквизиты.Контрагент);
	Запрос.УстановитьПараметр("Аналитика", Реквизиты.Аналитика);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Реквизиты.ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("Валюта", Реквизиты.Валюта);
	
КонецПроцедуры

Функция ТекстЗапросаКонтролируемыхСделокОрганизаций(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "КонтролируемыеСделкиОрганизаций";
	
	Если НЕ ПроведениеСерверУТ.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	&Ссылка КАК Регистратор,
	|	ВЫБОР
	|		КОГДА НАЧАЛОПЕРИОДА(ПрочиеКонтролируемыеСделкиСделки.ДатаСовершенияСделки, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период, ДЕНЬ)
	|				ИЛИ ПрочиеКонтролируемыеСделкиСделки.ДатаСовершенияСделки = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА &Период
	|		ИНАЧЕ ПрочиеКонтролируемыеСделкиСделки.ДатаСовершенияСделки
	|	КОНЕЦ КАК Период,
	|	&Уведомление КАК Уведомление,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Аналитика КАК Договор,
	|	ПрочиеКонтролируемыеСделкиСделки.ПредметСделки,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ПрочиеКонтролируемыеСделкиСделки.Ссылка КАК РасчетныйДокумент,
	|	&Валюта КАК Валюта,
	|	ПрочиеКонтролируемыеСделкиСделки.ЕдиницаИзмерения,
	|	ПрочиеКонтролируемыеСделкиСделки.Количество,
	|	ПрочиеКонтролируемыеСделкиСделки.СуммаБезНДСВРублях,
	|	ПрочиеКонтролируемыеСделкиСделки.СуммаБезНДСВВалютеРасчетов,
	|	ПрочиеКонтролируемыеСделкиСделки.СуммаНДСВРублях,
	|	ПрочиеКонтролируемыеСделкиСделки.СуммаНДСВВалютеРасчетов,
	|	ПрочиеКонтролируемыеСделкиСделки.НаименованиеПредметаСделки,
	|	ПрочиеКонтролируемыеСделкиСделки.ТипПредметаСделки,
	|	ПрочиеКонтролируемыеСделкиСделки.СтранаПроисхожденияПредметаСделки,
	|	ПрочиеКонтролируемыеСделкиСделки.СтавкаНДС,
	|	ПрочиеКонтролируемыеСделкиСделки.ТипКонтролируемойСделки,
	|	ПрочиеКонтролируемыеСделкиСделки.Грузоотправитель,
	|	ПрочиеКонтролируемыеСделкиСделки.Грузополучатель,
	|	ПрочиеКонтролируемыеСделкиСделки.ОперацияОблагаетсяЕНВД
	|ИЗ
	|	Документ.РегистрацияПрочихКонтролируемыхСделок.Сделки КАК ПрочиеКонтролируемыеСделкиСделки
	|ГДЕ 
	|	ПрочиеКонтролируемыеСделкиСделки.Ссылка = &Ссылка";
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

// Добавляет команду создания документа "Регистрация прочих контролируемых сделок".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.РегистрацияПрочихКонтролируемыхСделок) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РегистрацияПрочихКонтролируемыхСделок.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.РегистрацияПрочихКонтролируемыхСделок);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьУведомленияОКонтролируемыхСделках";
	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

#КонецОбласти

#КонецЕсли
